# Особенные механики

## Книга на починку
На сервере **отключен** обычный способ получения починки у жителя, (у жителя заблокирован торг починки ) теперь починку можно купить у странствующего торговца 1 штуку с шансом 70%. (другие способы остались нетронутыми)

## Фермы рейдов
На сервере **отключены** бесконечные фермы рейдов, новый рейд просто не появится.

## Фермы шалкеров
На сервере отключены автоматические фермы шалкеров (она не будет работать полностью).

## Житель Бронник (брони ахахахахаха)
На сервер отключен торг с жителями на любое алмазное снаряжение (другие способы остались нетронутыми)